#include "sort.h"
void read(int a[], int n)
{
	int i;
	for (i = 0; i < n; i++)
            scanf("%d", &a[i]);
}

void print(int a[], int n)
{
	int i;
	for (i = 0; i < n; i++)
		printf("%d ", a[i]);
	printf("\n");
}

void insertion_sort(int a[], int n)
{
	/***************************************************
	 * Даалгавар: Энэ хэсэгт өөрийн insertion sort-ийг
	 * хийх кодыг бичнэ.
	 * a     нь эрэмбэлэх хүснэгт
	 * n     нь хүснэгтэд байгаа утгуудын тоо
	 ***************************************************/

	int i, j, k;

	// j = Өмнөх байрлал
	// k = Одоо байгаа байрлал

	for(i = 1; i < n; i++){
		k = a[i];
		j = i - 1;

		while(j >= 0 && a[j] > k){
			a[j + 1] = a[j];
			j = j - 1;
		}
		a[j + 1] = k;
	}
}

void selection_sort(int a[], int n)
{
	/***************************************************
	 * Даалгавар: Энэ хэсэгт өөрийн selection sort-ийг
	 * хийх кодыг бичнэ.
	 * a     нь эрэмбэлэх хүснэгт
	 * n     нь хүснэгтэд байгаа утгуудын тоо
	 ***************************************************/
    
	int i, j, min;

	for(i = 0; i < n - 1; i++){
		min = i;

		for(j = i + 1; j < n; j++){
			if(a[j] < a[min])
			min = j;
		}

		int temp = a[min];
		a[min] = a[i];
		a[i] = temp;
	}

}

void bubble_sort(int a[], int n)
{
	/***************************************************
	 * Даалгавар: Энэ хэсэгт өөрийн bubble sort-ийг
	 * хийх кодыг бичнэ.
	 * a     нь эрэмбэлэх хүснэгт
	 * n     нь хүснэгтэд байгаа утгуудын тоо
	 ***************************************************/

	int i, j, temp;

	for(i = 0; i < n - 1; i++){
		for(j = 0; j < n - i - 1; j++){
			if(a[j] > a[j + 1]){
				temp = a[j];
				a[j] = a[j + 1];
				a[j + 1] = temp;
			}
		}
	}
	
}